{
        "biblioteca": { 
          "step": 0, 
          "branch": 0,
          "description": "Los libros polvorientos destacan en una estantería situada hacia la izquierda. De todos ellos hay un libro que te llama especialmente la atención",
          "actions": [
            {   
              "action": "leer",
              "object": "libro",
              "successResponse": "Lees en voz alta para espantar el miedo que te recorre el cuerpo. Con cada palabra, todo a tu alrededor vibra cada vez más, hasta que aparece ante ti una ventana etérea, circular, a través de la cual se puede observar una habitación"
            }
          ]
        },
        "habitación": { 
          "step": 1, 
          "branch": 0,
          "description": "La habitación es austera como corresponde a la de un hidalgo manchego del siglo XVI. Una escalera conecta tu habitación con el piso inferior y si miras atrás, todavía puedes ver el portal a la biblioteca",
          "actions": []
        },
        "zaguán": { 
          "step": 2,
          "branch": 0,
          "description": "Estas en el zaguán. Una amplia escalera te facilitará el acceso al piso superior y delante de ti, tienes las puertas que te llevan al comedor, la cocina y la puerta de salida",
          "actions": []
        },
        "cocina": { 
          "step": 3, 
          "branch": 0,
          "description": "En la antigua y acogedora cocina, desnuda de todo lo que pueda recordar olorosas comidas, queda una triste alacena y, al fondo, una despensa",
          "actions": [
            {   
              "action": "abrir",
              "object": "alacena",
              "requirementStatus": ["poner_armadura"],
              "successResponse": "Una rata salta, te intenta morder, pero gracias a la armadura lo único que consigue es romperse los dientes",
              "failResponse": "La rata salta sobre tu hidalgo rostro perjudicando tus globos oculares, ya no estás en condiciones de continuar con tu hidalga azaña",
              "death":true
            },
            {   
              "action": "examinar",
              "object": "alacena",
              "requirementStatus": ["abrir_alacena"],
              "successResponse": "Sobre una de las repisas encuentras una llave que parece ser de utilidad",
              "failResponse": "Convendría abrirla para poder examinarla mejor"
            },
            { 
              "action": "coger", 
              "object": "llave",
              "successResponse": "Guardala bien, nunca se sabe"
            }
          ]
        },
        "despensa": { 
          "step": 4,
          "branch": 0,
          "description": "La ténue luz que penetra por la puerta permite vislumbrar un baúl, cuya superficie cubierta por el polvo de los siglos encubre recuerdos de tus antepasados",
          "actions": [
            { 
              "action": "abrir",
              "object": "baúl",
              "successResponse": "Entre las muchas antigüallas, destaca una armadura vieja y ajada"
            },
            { 
              "action": "coger",
              "object": "armadura",
              "requirementStatus": ["abrir_baúl"], 
              "successResponse": "Claro que coges la armadura, ¿alguna vez viste un valiente hidalgo sin una?",
              "failResponse": "¡Vaya!, ¡además de hidalgo eres adivino!, ¡¡¡Ya sabes que hay algo en el baúl sin nisiquiera haberlo abierto!!!"
            },
            { 
              "action": "poner",
              "object": "armadura",
              "requirementObject": ["armadura"], 
              "successResponse": "Mejor llevarla puesta que cargar con ella en el zurrón, así pareces más hidalgo",
              "failResponse": "¿Intentas ponerte algo que nisiquiera tienes?, me temo lo peor de tu aventura..."
            }
          ]
        },
        "comedor": { 
          "step": 3, 
          "branch": 0,
          "description": "Te encuentras en el comedor de tu casa, rústico y sencillo, gobernado por una mesa de madera. Algo cuelga de la pared. También puedes observar que hay un currusco de pan sobre la mesa",
          "actions": [
            { 
              "action": "examinar",
              "object": "pared",
              "successResponse": "Una espada y un escudo cuelgan de la pared" 
            },
            { 
              "action": "coger",
              "object": "espada",
              "successResponse": "Una espada ¡claro!, ¡¡valiente hidalgo serías sin tener una!!" 
            },
            { 
              "action": "coger",
              "object": "currusco",
              "successResponse": "Siempre es interesante tener algo de comer cuando tienes hambre, muy inteligente" 
            }
          ]
        },
        "portalón": { 
          "step": 3, 
          "branch": 0,
          "description": "El portalón de tu casa, iluminado por la luz de un candelabro, te abrirá las puertas de tu nueva vida",
          "actions": [
            { 
              "action": "abrir",
              "object": "puerta",
              "requirementObject": ["llave"],
              "successResponse": "La puerta se abre con un estruendoso chirrido, se ve que nadie la ha usado en mucho tiempo. Más adelante ya divisas Argamasilla, ¡tu gran y amado pueblo!",
              "failResponse": "La puerta está cerrada a cal y canto, seguro que en alguna parte anda la llave"
            }
          ]
        },
        "argamasillla": { 
          "step": 4, 
          "branch": 0,
          "description": "Argamasilla de Alba, tu pueblo. Sus solitarias calles y piedras están mudas ante ti. A la izquierda alcanzas a ver el arco de salida del pueblo, a tu derecha las calles y frente a ti... ¿Que dirá ese bando que hay en el muro?",
          "actions": [
            { 
              "action": "leer",
              "object": "bando",
              "successResponse": "Si caballero te quieres armar, las armas tendrás que velar, en una posada de este lugar, desde la cual la luna verás" 
            }
          ]
        },
        "arco": { 
          "step": 5, 
          "branch": 0,
          "description": "Ya llegas al arco. Una arboleda está ahí, hacia el este, esperándote siempre con su sombra acogedora y secreta",
          "actions": []
        },
        "arboleda": { 
          "step": 6, 
          "branch": 0,
          "description": "¿Arboleda?, ¿selva?, las mayores sorpresas pueden esperarte en estos lugares. Detrás de ti dejas el arco de entrada al pueblo mientras que más adelante en el camino ves emerger un árbol muy peculiar, ¿será posible que haya un manzano en estos parajes?",
          "actions": [
            {   
              "action": "examinar",
              "object": "suelo",
              "successResponse": "El suelo es fértil y plagado de níscalos con un aspecto suculento" 
            },
            {   
              "action": "coger",
              "object": "níscalo",
              "requirementStatus": ["examinar_suelo"],
              "successResponse": "Perfecto, tener comida siempre te salva de algún que otro apuro",
              "failResponse": "¿Que quieres coger qué?"
            }
          ]
        },
        "manzano": { 
          "step": 7, 
          "branch": 0,
          "description": "Algo insólito en estos parajes, ¡un manzano!, que frutos tan sabrosos, una lástima que no los tengas a tu alcance. Podrías intentar coger una manzana o continuar hacia ese pinar que divisas más adelante",
          "actions": [
            {   
              "action": "golpear",
              "object": "manzano",
              "successResponse": "Una manzana cae al suelo"
            },
            { 
              "action": "coger",
              "object": "manzana",
              "requirementStatus": ["golpear_manzano"], 
              "successResponse": "¡Esto viene de maravilla cuando el hambre arrecia!",
              "failResponse": "No las alcanzas, deberías buscar una forma de hacer que caigan del árbol"
            }
          ]
        },
        "pinar": { 
          "step": 8, 
          "branch": 0,
          "description": "Continúas caminando por la arboleda. Estás contento porque, de momento, tu aventura se te está antojando un agradable paseo. Grandes bosques y arboledas, olor a pinos, un sol gentil... y el suelo está lleno de flores",
          "actions": [
            { 
              "action": "examinar",
              "object": "suelo",
              "successResponse": "El suelo está cubierto de hermosas flores, ¿amanitas Phalloides quizás?" 
            },
            { 
              "action": "coger",
              "object": "amanita",
              "successResponse": "¿Una flor? sí, ¿por qué no?. Tú eres el valiente hidalgo y también un hombre sensible" 
            }
          ]
        },
        "muro": { 
          "step": 9, 
          "branch": 1,
          "description": "Estás en un camino bloqueado por un enorme muro de piedra",
          "actions": [
            { 
              "action": "colocar",
              "object": "pedrusco",
              "requirementObject": ["pedrusco"],
              "successResponse": "Colocas el pedruco en la base del muro",
              "failResponse": "¿Que pedrusco?"
            },
            { 
              "action": "subir",
              "object": "pedrusco",
              "requirementStatus": ["dejar_pedrusco"],
              "successResponse": "Al subir al pedrusco, ya no parece tan imposible escalar el muro",
              "failResponse": "¿Que te quieres subir a qué?"
            },
            { 
              "action": "escalar",
              "object": "muro",
              "requirementStatus": ["subir_pedrusco"],
              "successResponse": "El suelo esta cubierto de hermosas flores, amanitas Phalloides quizás?",
              "failResponse": "El muro es demasiado alto, pero tú como gallardo hidalgo que eres decides intentar escalarlo. Mala suerte que te resbalas y mueres al caer desde lo alto",
              "death":true
            }
          ]
        },
        "callejón": { 
          "step": 10, 
          "branch": 1,
          "requirementStatus": ["escalar_muro"],
          "description": "Al cruzar el muro, el camino se acaba, solo puedes ver una botella en el suelo. Tu única opción es dar media vuelta. ",
          "actions": [
            { 
              "action": "coger",
              "object": "botella",
              "successResponse": "¿Quieres recoger una botella?, vaya, un hidalgo valiente y ecológico, ¡lo tienes todo!"
            }
          ]
        },
        "posada": { 
          "step": 9, 
          "branch": 0,
          "description": "Te encuentras ante la imponente puerta de una suntuosa posada... mentira, la puerta se cae a cachos y la posada luce de dudosa categoría cuanto menos. Antes de disponerte a llamar a esta puerta, te percatas de que a tu izquierda hay un pequeño camino, casi oculto por la maleza, que parece conducir hasta uno de los muros limítrofes con la posada",
          "actions": [
            { 
              "action": "llamar",
              "object": "puerta",
              "successResponse": "El posadero abre la puerta entre gruñidos. Se da media vuelta mientras se rasca el trasero. Dudas si entrar a lo que parece el recibidor"
            }
          ]
        },
        "recepción": { 
          "step": 10, 
          "branch": 0,
          "description": "Estás en el recibidor de la posada. ¿Cuánta gente habrá pasado aqui la noche?, al fondo ves unas escaleras, tampoco hace falta ser un genio para deducir que subiendolas llegarías a las habitaciones",
          "actions": []
        },
        "escalera": { 
          "step": 11, 
          "branch": 0,
          "description": "Un candelabro en una de las paredes ilumina el descansillo de la escalera. Parece tan viejo como todo lo demás. Quizás sería mejor ir directamente al rellano que hay arriba",
          "actions": [
            { 
              "action": "examinar",
              "object": "candelabro",
              "successResponse": "Una de las velas parece suelta"
            },
            { 
              "action": "coger",
              "object": "vela",
              "requirementStatus": ["examinar_candelabro"], 
              "successResponse": "Sí, mejor la guardamos, nunca se sabe cuando un poco de luz puede iluminar las ideas",
              "failResponse": "¿Qué vela?"
            }
          ]
        },
        "rellano": { 
          "step": 12, 
          "branch": 0,
          "description": "Estás en el primer rellano. Dos puertas, a izquierda y derecha, visibles gracias a la luz de la antorcha, te abrirán el paso a la bodega y dormitorio respectivamente. ¿Una bodega dices?, sí, no se por qué te extraña",
          "actions": []
        },
        "bodega": { 
          "step": 13, 
          "branch": 0,
          "description": "La estancia esta llena de odres, Huele a vino rancio y a queso picado. ¿O era al revés?",
          "actions": [
            { 
              "action": "abrir",
              "object": "odre",
              "requirementObject": ["martillo"],
              "successResponse": "Golpeas un odre y comienza a verter un vino de dudosa calidad",
              "failResponse": "El corcho está atascado, seguramente por que lleva siglos sin abrirse, necesitarás algo contundente con lo que abrirlo"
            },
            { 
              "action": "coger",
              "object": "vino",
              "requirementObject": ["botella"],
              "requirementStatus": ["abrir_odre"],
              "successResponse": "¿En serio quieres ese vino?, bueno... no seré yo quien te lo discuta",
              "failResponse": "Para guardar el vino no basta con poner las dos manos. Necesitas dos cosas, primero abrir el odre, y segundo, algún recipiente donde guardarlo."
            }
          ]
        },
        "dormitorio": { 
          "step": 13, 
          "branch": 1,
          "description": "Bonito dormitorio este. Una cama que hasta parece limpia domina la habitacion. ¿pero qué es eso que hay debajo? ¿parece un martillo? ",
          "actions": [
            { 
              "action": "coger",
              "object": "martillo",
              "successResponse": "Nos vendrá bien guardarlo por si queremos hacer algo de bricomanía"
            }
          ]
        },
        "calles": { 
          "step": 5, 
          "branch": 1,
          "description": "Otra calle, calles y más calles. Alguien se ha dejado un rastrillo apoyado en la pared y, al fondo, puedes ver como termina el pueblo y se abren los maravillosos campos",
          "actions": [
            { 
              "action": "coger",
              "object": "rastrillo",
              "successResponse": "¿Un rastrillo?, sí bueno, ¿por qué no?, si no sale bien lo de hidalgo siempre puedes ser granjero"
            }
          ]
        },
        "campos": { 
          "step": 6, 
          "branch": 1,
          "description": "Ante ti se extienden los bellos campos de la mancha. Cómo me gusta ese olor a trigo que inunda el aire. Más adelante en el camino ves la puerta destartalada de una venta, pero un camino oscuro llama tu atención a la izquierda. En un cartel ya casi deshecho por el paso del tiempo adivinas a leer 'peligro de acantilado, no pasar'",
          "actions": []
        },
        "acantilado": { 
          "step": 6, 
          "branch": 2,
          "description": "Un diminuto acantilado está frente ti. Quizás podrías cruzarlo de un salto, pero parece mucha distancia incluso para un valiente hidalgo. Creo que sería mejor darse media vuelta",
          "actions": [
            { 
              "action": "colocar",
              "object": "escalón",
              "requirementObject": ["escalón"],
              "successResponse": "Dejas el tablón y este hace de puente. Ahora puedes llegar al bosque que hay en frente sin problemas",
              "failResponse": "¿Que quieres colocar un escalón?, ¿Qué escalón?, ¡ay madre!, ahora me dirás que los molinos son gigantes..."
            },
            { 
              "action": "saltar",
              "object": "acantilado",
              "successResponse": "Demasiada fe tenías en tus habilidades. Por desgracia, no llegas al otro lado y ahora eres un hidalgo estrellado",
              "death":true
            }
          ]
        },
        "bosque": { 
          "step": 6, 
          "branch": 2,
          "requirementStatus": ["colocar_escalón"],
          "description": "Un oscuro bosque, tan oscuro que apenas alcanzas a ver poco más que un pedrusco en el suelo. Se escuchan lobos al rededor tuya. Yo me daría media vuelta y me iría",
          "failDescription": "No puedes llegar al bosque, antes debes cruzar un acantilado que tiene pinta que no podrás cruzar de un salto",
          "actions": [
            { 
              "action": "coger",
              "object": "pedrusco",
              "successResponse": "Un pedrusco, sí, como no, llévatelo. Llevate todo lo que te encuentres en el suelo"
            }
          ]
        },
        "venta": { 
          "step": 8, 
          "branch": 1,
          "description": "Te encuentras de bruces con la puerta de la venta que te llevará al recibidor. No es por criticar pero tiene aspecto de venirse abajo más pronto que tarde. A tu izquierda ves un pequeño camino que te lleva a los prados aledaños",
          "actions": []
        },
        "recibidor": { 
          "step": 9, 
          "branch": 1,
          "description": "Ves dos puertas ante ti, una te lleva al salon y por la otra llegas a un pequeño distribuidor con dos puertas y una mesilla",
          "actions": []
        },
        "salón": { 
          "step": 10, 
          "branch": 1,
          "description": "Que salón tan solitario y vacío. Desde luego aqui no saben como darle un toque hogareño a una estancia. Solo hay una gran mesa vacía y un pequeño cesto en una esquina",
          "actions": [
            { 
              "action": "examinar",
              "object": "cesto",
              "successResponse": "Dentro del cesto solo hay chatarra. Un alambre y poco más"
            },
            { 
              "action": "coger",
              "object": "alambre",
              "requirementStatus": ["examinar_cesto"],
              "successResponse": "Nos vendrá bien guardarlo por si queremos hacer algo de bricomanía",
              "failResponse": "Deberías examinar el cesto para ver que hay antes de meter la mano a lo loco. Solo dios sabe lo que puedes sacar de ahí."
            }
          ]
        },
        "distribuidor": { 
          "step": 10, 
          "branch": 1,
          "description": "Este distrubidor te permite acceder a dos estancias, a la izquierda una alcoba, y a la derecha una puerta cerrada que podrías abrir, si no fuera por que la cerradura esta atascada",
          "actions": [
            { 
              "action": "arreglar",
              "object": "cerradura",
              "requirementObject": ["alambre"],
              "successResponse": "Gracias a tus habilidades como antiguo lazarillo, consigues arreglar la cerradura usando solo un alambre. Ahora puedes abrirla y acceder a un confortable patio",
              "failResponse": "¿Y con qué quieres arreglarla?, ¿con una mirada seductora?, deberías buscar algo que quepa por la cerradura para poder arreglarla"
            }
          ]
        },
        "alcoba": { 
          "step": 11, 
          "branch": 1,
          "description": "Un dormitorio sin más. Una cama, un suelo... poco más. Para descansar es suficiente supongo",
          "actions": [
            { 
              "action": "descansar",
              "successResponse": "Perfecto, ahora podrás seguir tu camino brioso"
            }
          ]
        },
        "patio": { 
          "step": 11, 
          "branch": 1,
          "requirementStatus": ["arreglar_cerradura"],
          "description": "Al traspasar la puerta, accedes a un sorprendentemente acogedor patio, de no ser por que está lleno de gallinas que alborotan a tu alrededor. En una esquina disponen de un indispensable poco decorado con una estatuilla. Un momento... todo buen caballero debe velar sus armas por lo menos una vez en su vida, y esa estatuilla es un testigo ideal",
          "failDescription": "Estaria bien poder visitar el patio, pero una puerta rota te lo impide",
          "actions": [
            { 
              "action": "velar",
              "object": "armas",
              "requirementObject": ["armadura"],
              "successResponse": "¡Perfecto!, ¡ahora ya sí que eres todo un caballero!, haces cosas raras de vez en cuando pero... un caballero al fin y al cabo",
              "failResponse": "¿Cómo vas a velar las armas si niquiera tienes una armadura?, eso es de primero de valeroso hidalgo"
            }
          ]
        },
        "prados": { 
          "step": 6, 
          "branch": 2,
          "description": "Unos extensos prados, que solo destacan por un nutrido rebaño de ovejas, que pastan apacibles pero bloquean el paso",
          "actions": [
            { 
              "action": "atacar",
              "object": "ovejas",
              "requirementObject": ["espada"],
              "successResponse": "Se apartan a tu paso, permitiendo continuar tu camino a lo que parece ser una imponente cancela",
              "failResponse": "Por más aspavientos que hagas no servirá de nada, no impones tanto como para inquietarlas a no ser que tengas algo contundente que las asuste"
            }
          ]
        },
        "cancela": { 
          "step": 7, 
          "branch": 2,
          "description": "Una gran cancela custodiada por dos soldados. Más allá se extienden los dominios del gran reino de castilla, donde valientes hidalgos ponen a prueba su destreza y conocen a sus amadas doncellas. Yo intentaría cruzarla",
          "actions": [
            { 
              "action": "cruzar",
              "object": "cancela",
              "requirementObject": ["espada", "armadura"],
              "requirementStatus": ["velar_armas"],
              "successResponse": "Cruzas la puerta y es como atravesar la entrada a otro mundo. Prados verdes hasta donde alcanza la vista, regados de pequeños bosques y riachuelos, animados por el bello cantar de las aves más distinguidas... huele a felicidad y opulencia, y como si el destino te sonriese, una bella doncella está intentando arreglar su carruaje averiado junto a sus monjes acompañantes. ¡¡Es la oportunidad ideal para demostrar tu valía ante una bella dama!! CONTINUARÁ...",
              "failResponse": "Los soldados te echan a empujones entre sonoras risas. No tienes todo lo necesario para ser un caballero decían",
              "end":true
            }
          ]
        }
}
